Конфигурация/Catalogs/ПакетыДанныхКОбработке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПакетыДанныхКОбработке</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПакетовДанныхКОбработке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделенНаТома</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаменятьФайлыВКаталоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВажностиЭлектронногоПисьма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбрабатыватьТексты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОДоставке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаОтменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменившийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПривязанКТексту</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тома</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСлепыхКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленияОДоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленияОПрочтении</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбратныеАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ЖурналОбработкиПакетовДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналОбработкиПакетовДанных</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбработкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыДанныхКОбработке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ПакетыДанныхКОбработке/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = Объект.Файлы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	// Получаем версию из хранилища
	Попытка
		Адрес = ПолучитьДанныеВерсииНаСервере(СтрокаТаблицы.ИдентификаторВерсии);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось открыть файл из-за ошибки:%1", Символы.ПС +  ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	Попытка
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл из-за ошибки при получении данных из временного хранилища!");
		Возврат;
	КонецПопытки;
	
	Попытка
		УдалитьИзВременногоХранилища(Адрес);
	Исключение
		// Ну, не удалили и не удалили
	КонецПопытки;
	
	// Сохраняем версию во временный файл
	Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов();
	
	ИмяФайла = Каталог + ?(Прав(Каталог, 1) = "\", "", "\") + СтрокаТаблицы.Имя;
	
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл из-за ошибки при сохранении временного файла!");
		Возврат;
	КонецПопытки;
	
	// Открываем файл
	ЗапуститьПриложение(ИмяФайла);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура ОтменитьОбработкуПакета(Команда)
	
	СообщенияОбОшибках = Новый Массив;
	
	ОтменитьОбработкуПакетаНаСервере(СообщенияОбОшибках);
	
	Для Каждого Сообщение Из СообщенияОбОшибках Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	КонецЦикла;
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	СообщенияОбОшибках = Новый Массив;
	
	ВыполнитьОбработкуНаСервере(СообщенияОбОшибках);
	
	Для Каждого Сообщение Из СообщенияОбОшибках Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	КонецЦикла;
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТомаВКаталог(Команда)
	
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если ДВФ.Выбрать() Тогда
		
		ДанныеТомов = ПолучитьДанныеТомовНаСервере();
		
		Если ДанныеТомов = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ФайлыКУдалению = Новый Массив;
		
		Для Каждого ДанныеТома Из ДанныеТомов Цикл
			
			Попытка
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеТома.Адрес);
			Исключение
				
				ТекстОшибки = СтрШаблон("Том №%1 не выгружен из-за ошибки при получении данных файла из временного хранилища: %2", Формат(ДанныеТома.НомерСтроки, "ЧГ=0"), ОписаниеОшибки());
										
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
				Для Каждого Файл Из ФайлыКУдалению Цикл
					
					Попытка
						УдалитьФайлы(Файл);
					Исключение
						// Ну, не удалили и не удалили.
					КонецПопытки;
					
				КонецЦикла;
				
				Возврат;
				
			КонецПопытки;
			
			ПолноеИмяФайла = ДВФ.Каталог + ?(Прав(ДВФ.Каталог, 1) = "\", "", "\") + ДанныеТома.ИмяФайла;
			
			Попытка
				ДвоичныеДанные.Записать(ПолноеИмяФайла);
			Исключение
				
				ТекстОшибки = СтрШаблон("Том №%1 не выгружен из-за ошибки при записи файла: %2", Формат(ДанныеТома.НомерСтроки, "ЧГ=0"), ОписаниеОшибки());
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
				Для Каждого Файл Из ФайлыКУдалению Цикл
					
					Попытка
						УдалитьФайлы(Файл);
					Исключение
						// Ну, не удалили и не удалили.
					КонецПопытки;
					
				КонецЦикла;
				
				Возврат;
				
			КонецПопытки;
			
			ФайлыКУдалению.Добавить(ПолноеИмяФайла);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИДоступностьЭлементов(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
	
	Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.Ссылка)
		ИЛИ НЕ РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
		
		// Пакет еще не записан
		Элементы.ФормаВыполнитьОбработку.Видимость		= Ложь;
		Элементы.ФормаОтменитьОбработкуПакета.Видимость	= Ложь;
		
	ИначеЕсли ДанныеОбъекта.ОбработкаОтменена ИЛИ ОбработкаПакетаВыполнена(ДанныеОбъекта.Ссылка) Тогда
		
		// Обработка уже отменена
		Элементы.ФормаВыполнитьОбработку.Доступность		= Ложь;
		Элементы.ФормаОтменитьОбработкуПакета.Доступность	= Ложь;
		
	Иначе
		Элементы.ФормаВыполнитьОбработку.Видимость			= Истина;
		Элементы.ФормаВыполнитьОбработку.Доступность		= Истина;
		Элементы.ФормаОтменитьОбработкуПакета.Видимость		= Истина;
		Элементы.ФормаОтменитьОбработкуПакета.Доступность	= Истина;
	КонецЕсли;
	
	Если ДанныеОбъекта.Вид = ПредопределенноеЗначение("Перечисление.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо") Тогда
		Элементы.ГруппаВыгрузкаФайла.Видимость				= Ложь;
		Элементы.ГруппаВидыПакетов.ТекущаяСтраница			= Элементы.ГруппаЭлектронноеПисьмо;
		Элементы.ПолучателиУведомленияОДоставке.Видимость	= ДанныеОбъекта.УведомитьОДоставке;
		Элементы.ПолучателиУведомленияОПрочтении.Видимость	= ДанныеОбъекта.УведомитьОПрочтении;
	Иначе
		Элементы.ГруппаЭлектронноеПисьмо.Видимость	= Ложь;
		Элементы.ГруппаВидыПакетов.ТекущаяСтраница	= Элементы.ГруппаВыгрузкаФайла;
	КонецЕсли;
	
	Элементы.ГруппаОтменаОбработки.Видимость	= ДанныеОбъекта.ОбработкаОтменена;
	Элементы.Тома.Видимость						= ДанныеОбъекта.РазделенНаТома;
	
	Элементы.ГруппаВложения.Видимость = ДанныеОбъекта.Файлы.Количество() > 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработкаПакетаВыполнена(Пакет)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пакет", Пакет);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена КАК ОбработкаВыполнена
		|ИЗ
		|	РегистрСведений.ЖурналОбработкиПакетовДанных.СрезПоследних(
		|			,
		|			ПакетДанных = &Пакет
		|				И ИдентификаторТома = """") КАК ЖурналОбработкиПакетовДанныхСрезПоследних
		|ГДЕ
		|	ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьВидимостьИДоступностьЭлементов(ЭтаФорма);
	
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
		Элементы.ОтображаемыйТекст.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	ИначеЕсли Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.РазмеченныйТекст Тогда
		Элементы.ОтображаемыйТекст.Вид = ВидПоляФормы.ПолеФорматированногоДокумента;
	Иначе
		Элементы.ОтображаемыйТекст.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;	
	КонецЕсли;
	
	Если Элементы.ОтображаемыйТекст.Вид = ВидПоляФормы.ПолеHTMLДокумента
		И СтрНайти(НРег(Объект.Текст), "<html>") = 0
	Тогда
		ЭтаФорма.ОтображаемыйТекст = "<html>" + Объект.Текст + "</html>"; // без этих тегов поле HTML-документа отображается пустым
	Иначе
		ЭтаФорма.ОтображаемыйТекст = Объект.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьОбработкуПакетаНаСервере(СообщенияОбОшибках)
	
	РаботаСПакетамиДанныхКОбработке.ОтменитьОбработкуПакетов(Объект.Ссылка, СообщенияОбОшибках);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере(СообщенияОбОшибках)
	
	РаботаСПакетамиДанныхКОбработке.ОбработатьПакетыДанных(Объект.Ссылка, СообщенияОбОшибках);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВерсииНаСервере(ИдентификаторВерсии)
	
	Попытка
		ДанныеВерсии = РаботаСФайловымХранилищем.ПолучитьВерсиюФайла(ИдентификаторВерсии);
	Исключение
		ВызватьИсключение "Не удалось получить данные версии файла из файлового хранилища!";
	КонецПопытки;
	
	Возврат ДанныеВерсии.Адрес;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеТомовНаСервере()
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Объект.Тома Цикл
		
		Попытка
			Адрес = ПолучитьДанныеВерсииНаСервере(СтрокаТаблицы.ИдентификаторВерсии);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось выгрузить данные томов из-за ошибки:%1", Символы.ПС + ОписаниеОшибки()));
			Возврат Неопределено;
		КонецПопытки;
		
		ДанныеТома = Новый Структура;
		
		ДанныеТома.Вставить("ИмяФайла",		СтрокаТаблицы.Имя);
		ДанныеТома.Вставить("Адрес",		Адрес);
		ДанныеТома.Вставить("НомерСтроки",	СтрокаТаблицы.НомерСтроки);
		
		Результат.Добавить(ДанныеТома);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
